#################################
# Core brew stuff
#################################

tap "homebrew/cask"
tap "buo/cask-upgrade"


#################################
# Development
#################################

brew "composer"
brew "dnsmasq", restart_service: true
brew "gh"
brew "git"
brew "httpie"
brew "mysql@5.7", restart_service: true, link: true
brew "nginx", restart_service: true
brew "php", link: true
brew "pkg-config"
brew "redis", restart_service: true
brew "wget"
brew "yarn"

tap "nicoverbruggen/homebrew-cask"
cask "phpmon"

tap "axllent/apps"
brew "mailpit"

#################################
# Image & Video
#################################
brew "libvpx"
brew "youtube-dl"
brew "imagemagick"
brew "ffmpeg"


#################################
# Mac Store Applications
#################################
brew "mas"

mas "Keynote", id: 409183694
mas "Microsoft To Do", id: 1274495053
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835


#################################
# OSX Applications
#################################
cask_args appdir: "/Applications"

cask "adobe-acrobat-reader"
cask "caffeine"
cask "calibre"
cask "charles"
cask "cyberduck"
cask "devtoys"
cask "dropbox"
cask "docker"
cask "epoccam"
cask "elgato-stream-deck"
cask "firefox"
cask "google-chrome"
cask "google-drive"
cask "grandperspective"
cask "handbrake"
cask "insomnia"
cask "iterm2"
cask "jumpcut"
cask "libreoffice"
cask "libreoffice-language-pack"
cask "macdown"
cask "mediainfo"
cask "microsoft-teams"
cask "mysqlworkbench"
cask "imageoptim"
cask "obs"
cask "phpstorm"
cask "poedit"
cask "postman"
cask "pycharm-ce"
cask "raspberry-pi-imager"
cask "ray"
cask "rustdesk"
cask "sdformatter"
cask "sequel-ace"
cask "signal"
cask "skype"
cask "slack"
cask "sonos"
cask "sourcetree"
cask "steam"
cask "sublime-text"
cask "tableplus"
cask "teamviewer"
cask "timemachineeditor"
cask "thunderbird"
cask "transmission"
cask "tunnelblick"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"

tap "homebrew/cask-eid"
cask "eid-be"
cask "eid-be-viewer"


#################################
# OSX Quicklook improvement
#################################
cask "qlstephen"
cask "qlcolorcode"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlprettypatch"
cask "quicklook-csv"
cask "betterzip"
cask "webpquicklook"
cask "suspicious-package"


#################################
# Drivers (+ apps)
#################################
tap "homebrew/cask-drivers"
cask "ubiquiti-unifi-controller"


#################################
# ZSH
#################################
brew "zsh"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
tap "sambadevi/powerlevel9k"
brew "powerlevel9k"
tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"


#################################
# Macport (preferences sync)
#################################
brew "mackup"

#################################
# Tooling
#################################
brew "rsync"
