cask_args appdir: "~/Applications"

#################################
# Development
#################################

brew "composer"
brew "dnsmasq", restart_service: true
brew "gh"
brew "git"
brew "git-trim"
brew "httpie"
brew "mysql", restart_service: true, link: true
brew "nginx", restart_service: true
brew "php", link: true
brew "pkg-config"
brew "redis", restart_service: true
brew "wget"
brew "yarn"

tap "nicoverbruggen/homebrew-cask"
cask "phpmon"

brew "mailpit"

#################################
# Image & Video
#################################
brew "libvpx"
brew "yt-dlp"
brew "imagemagick"
brew "ffmpeg"


#################################
# Mac Store Applications
#################################
brew "mas"

mas "Keynote", id: 409183694
mas "Microsoft To Do", id: 1274495053
mas "Numbers", id: 409203825
mas "Pages", id: 409201541


#################################
# OSX Applications
#################################
cask "calibre"
cask "charles"
cask "cursor"
cask "cyberduck"
cask "dbngin"
cask "dropbox"
cask "docker-desktop"
cask "epoccam"
cask "elgato-stream-deck"
cask "firefox"
cask "google-chrome"
cask "google-drive"
cask "grandperspective"
cask "handbrake-app"
cask "herd"
cask "home-assistant"
cask "insomnia"
cask "iterm2"
cask "jumpcut"
cask "libreoffice"
cask "libreoffice-language-pack"
cask "mediainfo"
cask "microsoft-teams"
cask "imageoptim"
cask "obs"
cask "phpstorm"
cask "plex"
cask "poedit"
cask "pycharm"
cask "raspberry-pi-imager"
cask "ray"
cask "rustdesk"
cask "sdformatter"
cask "signal"
cask "slack"
cask "sonos"
cask "sourcetree"
cask "steam"
cask "sublime-text"
cask "tableplus"
cask "teamviewer"
cask "timemachineeditor"
cask "the-unarchiver"
cask "thunderbird"
cask "transmission"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "wifiman"


#################################
# OSX Quicklook improvement
#################################
cask "qlstephen"
cask "qlcolorcode"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlprettypatch"
cask "quicklook-csv"
cask "betterzip"
cask "webpquicklook"
cask "suspicious-package"

#################################
# ZSH
#################################
brew "zsh"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "powerlevel10k"
cask "font-hack-nerd-font"


#################################
# Macport (preferences sync)
#################################
brew "mackup"

#################################
# Tooling
#################################
brew "rsync"
